/*
 Navicat MySQL Data Transfer

 Source Server         : local
 Source Server Version : 80015
 Source Host           : localhost
 Source Database       : test

 Target Server Version : 80015
 File Encoding         : utf-8

 Date: 07/25/2019 17:41:23 PM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `es_sss_goods_data`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_goods_data`;
CREATE TABLE `es_sss_goods_data` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `goods_id` int(10) DEFAULT NULL COMMENT '商品id',
  `goods_name` varchar(255) DEFAULT NULL COMMENT '商品名称',
  `brand_id` int(10) DEFAULT NULL COMMENT '品牌id',
  `category_id` int(10) DEFAULT NULL COMMENT '分类id',
  `category_path` varchar(255) DEFAULT NULL COMMENT '分类路径',
  `price` decimal(20,2) DEFAULT NULL COMMENT '商品价格',
  `favorite_num` int(10) DEFAULT NULL COMMENT '收藏数量',
  `market_enable` smallint(1) DEFAULT NULL COMMENT '是否上架',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=264 DEFAULT CHARSET=utf8 COMMENT='统计库商品数据(es_sss_goods_data)';

-- ----------------------------
--  Records of `es_sss_goods_data`
-- ----------------------------
BEGIN;
INSERT INTO `es_sss_goods_data` VALUES ('1', '1', '百草味菠萝干100g 菠萝块凤梨干/片蜜饯水果干小吃', '0', '14', '0|1|13|14|', '25.90', '2', '1'), ('2', '2', '百草味手剥松子128g 坚果炒货干果特产开口手拨瓜子大籽', '0', '2', '0|1|2|', '35.60', '0', '1'), ('3', '3', '百草味手剥松子128g 坚果炒货干果特产开口手拨瓜子大籽', '0', '2', '0|1|2|', '12.50', '0', '1'), ('4', '4', '良品铺子酸奶果粒块54g草莓蓝莓干水果酸奶块休闲零食特产小吃', '0', '377', '0|1|377|', '195.00', '0', '1'), ('5', '5', '百草味仁仁果750g 每日坚果仁混合果仁30袋干果零食', '0', '2', '0|1|2|', '15.90', '0', '1'), ('6', '6', '良品铺子山楂片250g山楂干山楂圆片零食蜜饯特产食品', '0', '318', '0|4|5|318|', '89.00', '0', '1'), ('7', '8', '百草味冻干榴莲干30g 金枕头榴莲干 休闲零食水果干', '0', '31', '0|4|31|', '29.90', '0', '1'), ('8', '9', '良品铺子猪肉脯自然片100g原味休闲食品猪肉干猪肉铺零食小吃', '0', '326', '0|4|325|326|', '56.90', '0', '1'), ('9', '10', '百草味牛轧奶芙(蔓越莓味)160g 沙琪玛牛萨萨糕点心', '0', '368', '0|4|27|368|', '29.80', '0', '1'), ('10', '11', '百草味板栗仁80g 坚果零食特产熟制甘栗仁即食栗子仁', '0', '358', '0|4|358|', '52.90', '0', '1'), ('11', '12', '良品铺子烤香肠145g小香肠零食特产猪肉枣烤肉肠红肠', '0', '36', '0|35|36|', '150.90', '0', '1'), ('12', '13', '百草味麻薯(抹茶味)210g 糕点小吃美食 休闲零食点心', '0', '144', '0|35|144|', '180.99', '0', '1'), ('13', '14', '朵趣手造芒果味爆浆麻薯台式手工特产小吃糕点心208g', '0', '153', '0|35|151|153|', '259.00', '0', '1'), ('14', '15', '洋河蓝色经典 海之蓝52度375ml 2瓶 洋河官方旗舰店 绵柔型白酒', '0', '431', '0|35|429|431|', '299.00', '0', '1'), ('15', '16', '熊孩子 综合水果干108gx2袋混合装果干什锦脱水蔬果脆片休闲零食', '0', '164', '0|35|160|164|', '599.00', '0', '1'), ('16', '17', '好时之吻KISSES巧克力500g曲奇味糖果零食婚庆结婚喜糖袋装批发', '0', '40', '0|38|39|40|', '59.00', '0', '1'), ('17', '18', '【憨豆熊 纸皮巴旦木208g*2袋】杏仁坚果零食手剥干果扁桃仁', '0', '48', '0|38|47|48|', '50.00', '0', '1'), ('18', '19', '三只松鼠 开心果100g休闲零食每日坚果特产炒货原味无漂白', '0', '54', '0|38|51|54|', '47.90', '0', '1'), ('19', '20', '三只松鼠 夏威夷果265g零食每日坚果特产食品果仁送开口器奶油味', '0', '172', '0|38|171|172|', '25.90', '0', '1'), ('20', '21', '三只松鼠 炭烧腰果90g坚果零食每日坚果特产干果仁', '0', '45', '0|38|43|45|', '59.80', '0', '1'), ('21', '22', '情侣装冬装2017新款秋冬季韩版中长款修身呢子大衣女加厚毛呢外套', '0', '57', '0|56|57|', '25.99', '1', '1'), ('22', '23', 'PANMAX潮牌大码男装 胖子冬装男衣服羊羔绒宽松加肥加大连帽卫衣', '0', '91', '0|86|91|', '52.90', '0', '1'), ('23', '24', '中长款韩版风衣男潮牌百搭加绒加厚大衣冬季外套2017新款帅气学生', '0', '275', '0|86|91|275|', '79.90', '0', '1'), ('24', '25', '伟臣潮牌大码男装秋冬装毛衣男士加肥加大开叉针织衫肥佬胖子打底', '0', '149', '0|35|144|149|', '159.90', '0', '1'), ('25', '26', '纺布者潮牌大码男装秋季加肥加大宽松衬衣胖子拼接男士长袖衬衫潮', '0', '149', '0|35|144|149|', '199.90', '0', '1'), ('26', '27', '纺布者潮牌大码卫衣男加肥加大秋季新款男士长袖胖子时尚宽松上衣', '0', '2', '0|1|2|', '15.90', '0', '1'), ('27', '28', '纺布者大码潮牌秋季毛衣男士胖子休闲加肥加大宽松圆领套头针织衫', '0', '275', '0|86|91|275|', '25.90', '0', '1'), ('28', '29', '纺布者大码男装秋季加肥加大男士套头毛衣胖子针织衫秋款圆领毛衫', '0', '102', '0|86|91|102|', '59.90', '0', '1'), ('29', '30', '吊裆裤哈伦裤男九分裤HIPHOP嘻哈宽松裤子潮牌加绒垮裤低裆拉裆裤', '0', '103', '0|86|91|103|', '199.90', '0', '1'), ('30', '31', '男装加肥加大宽松胖子照片印花胖人黑色夹克外套轻薄', '0', '103', '0|86|91|103|', '155.90', '0', '1'), ('31', '32', '冬季欧美仙鹤潮牌bf加绒刺绣卫衣男连帽中国风男装大码国潮外套潮', '0', '389', '0|38|39|389|', '59.90', '0', '1'), ('32', '33', '唐狮秋冬装毛衣男女情侣装毛衣韩版宽松bf毛衫网红线衣针织衫', '0', '380', '0|1|377|380|', '59.90', '0', '1'), ('33', '34', '唐狮情侣装毛衣男秋季新款圆领套头韩版学生针织衫线衣百搭上衣潮', '0', '377', '0|1|377|', '199.90', '0', '1'), ('34', '35', '唐狮秋冬季情侣装毛衣男女韩版图案小清新圆领套头学生针织衫', '0', '79', '0|79|', '259.90', '0', '1'), ('35', '36', '唐狮2018春装新款连帽套头卫衣男潮流潮牌男帽衫宽松个性男士外套', '0', '429', '0|35|429|', '125.90', '0', '1'), ('36', '37', '男装秋冬羊毛呢子休闲西服纯手工双面呢韩版修身无羊绒小西装外套', '0', '397', '0|38|47|397|', '88.90', '0', '1'), ('37', '38', '小西装男韩版修身冬季加厚上衣外套青年帅气呢子休闲西服呢料单西', '0', '163', '0|35|160|163|', '9000.99', '0', '1'), ('38', '39', '猫人男装中长款羽绒服男冬季新款青年黑色修身连帽韩版休闲外套', '0', '39', '0|38|39|', '155.90', '0', '1'), ('39', '40', 'JSMIX胖胖星球大码男装加肥加大宽松潮胖子趣味印花长袖T恤春季', '0', '106', '0|86|91|106|', '788.90', '0', '1'), ('40', '41', 'JSMIX大码潮牌男装加肥加大宽松胖子裤子撞色拼接休闲裤长裤男裤', '0', '149', '0|35|144|149|', '2500.99', '0', '1'), ('41', '42', '相宜本草光彩立现白茶睡眠面膜 补水保湿女滋润整晚养护专柜正品', '0', '120', '0|86|116|120|', '4559.00', '0', '1'), ('42', '44', '伊贝诗深海绿洲醒肤液补水保湿深层清洁控油爽肤水保湿水化妆水', '0', '37', '0|35|36|37|', '799.90', '0', '1'), ('43', '45', '瑜然美 美容橄榄油护肤精油护发身体按摩防干裂全身脸部刮痧外用', '0', '115', '0|86|109|115|', '599.90', '0', '1'), ('44', '48', '百雀羚三生花舒缓细肤柔润凝乳精华乳液女补水保湿学生', '0', '168', '0|1|18|168|', '0.01', '0', '1'), ('45', '49', '百雀羚小森羚温和净颜卸妆水脸部眼唇卸妆液清洁毛孔不油腻', '0', '21', '0|1|18|21|', '1599.00', '0', '1'), ('46', '50', '百雀羚小森羚海棠身体乳润肤乳保湿滋润补水淡香润体乳学生少女', '0', '19', '0|1|18|19|', '2999.99', '0', '1'), ('47', '51', '佳雪芦荟保湿霜3瓶量贩套装国货护肤品芦荟胶滋润补水面霜', '0', '19', '0|1|18|19|', '5999.00', '0', '1'), ('48', '58', 'innisfree/悦诗风吟轻澈洁面仪(吾皇万睡限量版)', '0', '111', '0|86|108|111|', '159.00', '0', '1'), ('49', '59', '百雀羚三生花青春紧弹活颜美容液100ml 面部精华补水保湿紧致嫩', '0', '37', '0|35|36|37|', '169.99', '0', '1'), ('50', '60', 'LA MER海蓝之谜臻璨焕活面部精华油 补水保湿修护', '0', '37', '0|35|36|37|', '159.99', '0', '1'), ('51', '61', '法国正品玫瑰香水女士持久淡香清新自然专柜魅力学生礼物喷雾小样', '0', '137', '0|79|135|137|', '159.99', '0', '1'), ('52', '62', '维维尼奥香水女士持久淡香水 法式精致淡香憧憬清新女香专柜正品', '0', '109', '0|86|109|', '12.50', '0', '1'), ('53', '63', 'LA MER海蓝之谜赋活保湿精华露30ml 水润保湿 润泽', '0', '385', '0|38|39|385|', '199.00', '0', '1'), ('54', '64', 'SK-II sk2粉底skii棒棒糖粉凝霜 臻美焕透晶透粉霜遮瑕防晒SPF30', '0', '383', '0|38|39|383|', '169.99', '0', '1'), ('55', '65', '兰蔻 黑金臻宠精华乳30ml 柔软平滑紧致光泽 淡细纹补水保湿滋润', '0', '385', '0|38|39|385|', '0.01', '0', '1'), ('56', '101', '亲子装2017新款秋冬季母女装针织衫韩版宽松外穿毛衣纯色打底春装', '0', '58', '0|56|57|58|', '385.00', '0', '1'), ('57', '102', '草莓南瓜亲子装2018新款母女装冬装白色羽绒服韩版中长款加厚外套', '0', '61', '0|56|57|61|', '199.00', '0', '1'), ('58', '103', '女童装旗袍新年唐装冬过年衣服3喜庆4岁中国风儿童拜年男套装宝宝', '0', '63', '0|56|62|63|', '119.80', '0', '1'), ('59', '104', '双鹰遥控搅拌车工程车电动玩具水泥车混凝土罐车汽车模型儿童男孩', '0', '64', '0|56|62|64|', '58.90', '0', '1'), ('60', '105', '宝贝第一 儿童安全座椅 婴儿安全座椅汽车用 0-6岁 车载宝宝座椅', '0', '65', '0|56|62|65|', '45.00', '0', '1'), ('61', '107', '儿童电动车摇摆童车四轮室内车带遥控玩具车可坐人摩托车电动汽车', '0', '69', '0|56|66|69|', '67.32', '0', '1'), ('62', '108', '特宝儿一岁男宝宝益智滑翔轨道车玩具小汽车儿童玩具车男孩2-3岁', '0', '70', '0|56|66|70|', '65.00', '0', '1'), ('63', '109', '大型儿童电动车四轮卡丁车小孩玩具汽车宝宝遥控可坐人童车', '0', '426', '0|56|66|426|', '135.00', '0', '1'), ('64', '110', '米兔故事机mini儿童早教机宝宝婴儿幼儿玩具学习机', '0', '72', '0|56|71|72|', '198.00', '1', '1'), ('65', '111', '亿宝莱高景观婴儿推车可坐可躺轻便携式折叠小孩宝宝双向婴儿童车', '0', '73', '0|56|71|73|', '59.80', '1', '1'), ('66', '112', '亲子装夏女童沙滩裙2017新母女装波西米亚长裙海边度假公主连衣裙', '0', '73', '0|56|71|73|', '85.00', '0', '1'), ('67', '113', '过年亲子装冬装2018新款潮拜年服母女棉衣外套冬季棉服收腰中长款', '0', '74', '0|56|71|74|', '39.90', '0', '1'), ('68', '114', '宝宝唐装冬周岁男童汉服儿童女童中国风过年拜年喜庆新年衣服套装', '0', '74', '0|56|71|74|', '68.00', '0', '1'), ('69', '115', '亲子装冬装2018新款潮秋装母子母女装旗袍全家装一家三口唐装套装', '0', '78', '0|56|75|78|', '198.00', '0', '1'), ('70', '116', '恬贝儿 亲子装秋装母女装连衣裙2017新款潮韩版中袖修身亲子礼服', '0', '201', '0|56|200|201|', '798.00', '0', '1'), ('71', '117', '恬贝儿 母女装秋装连衣裙2017新款潮韩版亲子装秋冬女童礼服裙子', '0', '202', '0|56|200|202|', '409.00', '0', '1'), ('72', '118', '女童三件套运动套装2017新款5宝宝3秋冬装4加绒卫衣6岁儿童装加厚', '0', '204', '0|56|200|204|', '249.00', '0', '1'), ('73', '119', 'amii童装秋款亲子装小童休闲套装母女装纯棉卫衣裤子童装两件套', '0', '210', '0|56|208|210|', '1599.00', '0', '1'), ('74', '120', '女童秋装套装2018新款韩版女孩中大童装春秋季儿童休闲运动两件套', '0', '214', '0|56|212|214|', '41.90', '0', '1'), ('75', '121', '童装男童秋冬装套装2018新款儿童加绒加厚金丝绒卫衣三件套中大童', '0', '205', '0|56|200|205|', '996.00', '0', '1'), ('76', '125', '旗袍连衣裙2018新款冬季名媛宴会晚礼服少女小香风复古中国风长款', '0', '98', '0|86|96|98|', '99.00', '0', '1'), ('77', '126', 'VeroModa中腰破洞A版牛仔短裤女|316343009', '0', '99', '0|86|96|99|', '199.00', '0', '0'), ('78', '127', '宴会晚礼服2018新款高贵优雅性感长款香槟色鱼尾礼服裙女公司年会', '0', '100', '0|86|96|100|', '128.00', '0', '1'), ('79', '128', '新娘2018新款秋冬季中式立领鱼尾长款长袖红色结婚晚礼服女', '0', '101', '0|86|96|101|', '398.00', '0', '1'), ('80', '129', '冬季旗袍2018新款少女长袖连衣裙宴会派对聚会晚礼服短款公司年会', '0', '272', '0|86|96|272|', '551.00', '0', '1'), ('81', '130', '2018裙子夏波西米亚长裙沙滩裙海边度假显瘦雪纺连衣裙', '0', '273', '0|86|96|273|', '229.00', '0', '1'), ('82', '131', '泰国旅游沙滩裙女夏2017新款波西米亚海边度假显瘦性感连衣裙长裙', '0', '274', '0|86|96|274|', '799.00', '0', '1'), ('83', '132', '职业装套装女2017新款时尚秋冬气质OL商务面试西装正装西服工作服', '0', '110', '0|86|108|110|', '369.00', '0', '1'), ('84', '133', '玛玛绨2018春装新款个性刺绣休闲棒球服夹克女装时尚宽松短外套潮', '0', '112', '0|86|108|112|', '1298.00', '0', '1'), ('85', '134', '金丝绒套装女2017冬季新款时尚休闲运动服女潮加绒加厚卫衣三件套', '0', '279', '0|86|108|279|', '1189.00', '0', '1'), ('86', '135', '职业装女装套装女裤秋冬马甲西装正装面试OL上班修身气质工作服', '0', '280', '0|86|108|280|', '48.00', '0', '1'), ('87', '136', '夜店女装2018秋冬新款时尚套装气质修身性感显瘦包臀连衣裙两件套', '0', '117', '0|86|116|117|', '198.00', '0', '1'), ('88', '137', '运动服套装女春秋2017新款潮韩版女装时尚长袖卫衣显瘦休闲两件套', '0', '118', '0|86|116|118|', '698.00', '0', '1'), ('89', '138', '琳卡索2018春季新款韩版宽松套头糖果色少女后交叉蝙蝠袖卫衣女潮', '0', '99', '0|86|96|99|', '1490.00', '0', '1'), ('90', '139', '七格格一字肩喇叭袖上衣2017秋时尚宽松遮肉长袖中长款雪纺衫女薄', '0', '98', '0|86|96|98|', '198.00', '0', '1'), ('91', '141', '韩都衣舍2018新款女装春装韩版连帽印花宽松显瘦打底休闲长袖卫衣', '0', '100', '0|86|96|100|', '199.00', '0', '1'), ('92', '142', '春秋连衣裙长袖女装2018新款韩版小清新潮时尚显瘦卫衣小个子学生', '0', '272', '0|86|96|272|', '274.00', '0', '1'), ('93', '143', '七格格紫色卫衣女宽松bf2018春装新款学生长袖ins小清新上衣短款', '0', '110', '0|86|108|110|', '499.00', '0', '1'), ('94', '144', '伊芙丽2018春装新款韩版长袖衬衣欧洲站chic宽松雪纺白衬衫女韩范', '0', '117', '0|86|116|117|', '398.00', '0', '1'), ('95', '145', 'Paul Frank/大嘴猴17秋设计师款女士烫金印花学院风棒球服外套', '0', '118', '0|86|116|118|', '338.00', '0', '1'), ('96', '148', '', '0', '37', '0|35|36|37|', '0.00', '0', '2'), ('97', '155', 'Fujifilm/富士X-A3套机单电自拍复古富士xa3微单相机', '0', '139', '0|79|135|139|', '318.00', '0', '1'), ('98', '156', '狼蛛掌控者机械键盘青轴游戏背光单手守望先锋lol吃鸡电竞宏定义', '0', '246', '0|85|245|246|', '99.00', '0', '1'), ('99', '157', '伊索正品精钢全自动机械表 时尚夜光手表男士防水多功能男表9027', '0', '164', '0|35|160|164|', '2350.00', '0', '1'), ('100', '171', '联想（Lenovo）IdeaPad 500S 笔记本电脑', '161', '494', '0|491|492|494|', '5399.00', '0', '1'), ('101', '172', '联想（Lenovo）Y50p-70 15.6英寸游戏笔记本', '161', '494', '0|491|492|494|', '6184.00', '0', '1'), ('102', '173', '未来人类(Terrans Force)S4-1060-67S', '168', '494', '0|491|492|494|', '11999.00', '0', '1'), ('103', '174', 'Apple iPhone 7 Plus 128GB 亮黑色 ', '151', '497', '0|491|492|497|', '6448.00', '0', '1'), ('104', '175', '美的(Midea)WFS3018Q智能可预约电饭煲 3升/3', '162', '501', '0|491|500|501|', '189.00', '0', '1'), ('105', '176', '美的（Midea）MB-WFS4017TM 特色圆灶釜 智能', '162', '501', '0|491|500|501|', '299.00', '0', '1'), ('106', '177', 'Apple iPhone 7 Plus 128GB 玫瑰金色', '151', '497', '0|491|492|497|', '6488.00', '0', '1'), ('107', '178', 'HUAWEI nova（3GB+32GB）CAZ-TL10 ', '159', '497', '0|491|492|497|', '1596.00', '0', '1'), ('108', '179', 'OPPO A57 全网通 3GB+32GB内存版 玫瑰金', '153', '497', '0|491|492|497|', '1799.00', '0', '1'), ('109', '180', 'OPPO R9s Plus 6GB+64GB内存版 全网通4', '153', '497', '0|491|492|497|', '2099.00', '0', '1'), ('110', '181', 'Xiaomi小米 红米Pro 高配版64G全网通手机-金色', '170', '497', '0|491|492|497|', '1228.00', '0', '1'), ('111', '182', 'Xiaomi小米 红米Pro 高配版64G全网通手机-银色', '170', '497', '0|491|492|497|', '1288.00', '0', '1'), ('112', '183', '锤子M1L白色-6G+64GB移动联通电信全网通公开版', '154', '497', '0|491|492|497|', '3184.00', '0', '1'), ('113', '184', '罗技（Logitech）G402 高速追踪游戏鼠标 吃鸡鼠标', '173', '505', '0|491|502|505|', '249.00', '0', '1'), ('114', '185', '锤子M1-咖啡金-4G+32GB 移动联通电信全网通', '154', '497', '0|491|492|497|', '2999.00', '0', '1'), ('115', '186', '红米Note 4 高配全网通版 3GB内存 64GB 金色', '170', '497', '0|491|492|497|', '1199.00', '0', '1'), ('116', '187', '华为 P9 (EVA-AL10) 4GB+64GB 琥珀金 ', '159', '497', '0|491|492|497|', '2899.00', '0', '1'), ('117', '188', '华为荣耀NOTE 8 4GB+32GB 全网通版', '159', '497', '0|491|492|497|', '1999.00', '0', '1'), ('118', '189', '雷蛇（Razer）奥罗波若蛇 Ouroboros 游戏鼠标', '179', '505', '0|491|502|505|', '996.00', '0', '1'), ('119', '190', '魅蓝X 珠光白 3+32G全网通公开版', '164', '497', '0|491|492|497|', '1199.00', '0', '1'), ('120', '191', '魅族 魅蓝note5 4G+全网通版 灰色 移动联通电信4G', '164', '497', '0|491|492|497|', '1049.00', '0', '1'), ('121', '192', '魅族 魅蓝Note5 全网通公开版 32GB 月光银 移动联', '164', '497', '0|491|492|497|', '1049.00', '0', '1'), ('122', '193', '海尔（Haier）BCD-310WDPF 310升多门冰箱 ', '157', '495', '0|491|493|495|', '3699.00', '0', '1'), ('123', '194', '海尔（Haier）BCD-452WDPF 452升对开门冰箱', '157', '495', '0|491|493|495|', '3199.00', '0', '1'), ('124', '195', '华硕（ASUS）Spatha ROG玩家国度 游戏鼠标', '181', '505', '0|491|502|505|', '1299.00', '0', '1'), ('125', '196', '美的(Midea)BCD-529WKGPZM(E) 529升', '162', '495', '0|491|493|495|', '3998.00', '0', '1'), ('126', '197', '美菱(MELING) BCD-551WPCX 551升', '163', '495', '0|491|493|495|', '2999.00', '0', '1'), ('127', '198', '西门子(SIEMENS) BCD-610W(KA92NV03', '169', '495', '0|491|493|495|', '6599.00', '0', '1'), ('128', '199', 'TCL D55A620U 55英寸 观影王4K版', '155', '496', '0|491|493|496|', '3999.00', '0', '1'), ('129', '200', '创维(Skyworth) 55M7 55英寸', '156', '496', '0|491|493|496|', '2799.00', '0', '1'), ('130', '201', '海尔(Haier)LE32B310P 32英寸 蓝光全高清 ', '157', '496', '0|491|493|496|', '999.00', '0', '1'), ('131', '202', '海信(Hisense)LED50EC660US 50英寸', '158', '496', '0|491|493|496|', '2799.00', '0', '1'), ('132', '203', '小米（MI）米家IH电饭煲 智能电饭煲 IH电磁环绕加热 手', '170', '501', '0|491|500|501|', '399.00', '0', '1'), ('133', '204', '海信(Hisense)LED55EC660US 55英寸', '158', '496', '0|491|493|496|', '3199.00', '0', '1'), ('134', '205', '美的（Midea）微波炉M1-L213C 21L 家用 转盘', '162', '511', '0|491|500|511|', '359.00', '0', '1'), ('135', '206', '海信(Hisense)LED65EC780UC 65英寸 ', '158', '496', '0|491|493|496|', '7599.00', '0', '1'), ('136', '207', '三星(SAMSUNG)UA55JU50SWJXXZ', '165', '496', '0|491|493|496|', '3299.00', '0', '1'), ('137', '208', '索尼(SONY)KD-55X8500D 55英寸 ', '167', '496', '0|491|493|496|', '6999.00', '0', '1'), ('138', '209', '索尼(SONY)KDL-48W650D 48英寸 全高清LE', '167', '496', '0|491|493|496|', '3199.00', '0', '1'), ('139', '210', '长虹(CHANGHONG)60G3 60英寸25核轻薄4K ', '172', '496', '0|491|493|496|', '4399.00', '0', '1'), ('140', '211', '三洋（SANYO）WF810326BS0S 8公斤', '166', '498', '0|491|493|498|', '1738.00', '0', '1'), ('141', '212', '三洋（SANYO）WT8455M0S 8公斤', '166', '498', '0|491|493|498|', '998.00', '0', '1'), ('142', '213', '西门子(SIEMENS) XQG70-WM10N0600W ', '169', '498', '0|491|493|498|', '2498.00', '0', '1'), ('143', '214', '西门子(SIEMENS) XQG90-WM12P2681W ', '169', '498', '0|491|493|498|', '4498.00', '0', '1'), ('144', '215', '小天鹅(Little Swan)TB80-Mute60WD ', '171', '498', '0|491|493|498|', '1398.00', '0', '1'), ('145', '216', 'Apple苹果 iPhone 8 64GB', '151', '497', '0|491|492|497|', '6338.00', '0', '1'), ('146', '217', '【惠普杨洋定制本】惠普(HP)畅游人Pavilion', '160', '494', '0|491|492|494|', '4998.00', '0', '1'), ('147', '218', 'Apple iPad Pro 平板电脑', '151', '499', '0|491|492|499|', '7684.00', '0', '1'), ('148', '219', 'Apple MacBook Air11.6英寸笔记本电脑', '151', '494', '0|491|492|494|', '4499.00', '0', '1'), ('149', '220', '罗技（Logitech)G502 游戏鼠标', '173', '505', '0|491|502|505|', '329.00', '0', '1'), ('150', '221', '戴尔（DELL）Vostro成就 14TR-5625SS ', '152', '494', '0|491|492|494|', '4699.00', '0', '1'), ('151', '222', '戴尔（DELL）成就Vostro 15-3559-2628B', '152', '494', '0|491|492|494|', '6599.00', '0', '1'), ('152', '223', '雷蛇（Razer） Deathadder 炼狱蝰蛇1800 ', '179', '505', '0|491|502|505|', '149.00', '0', '1'), ('153', '224', '美的（Midea）嵌入式微波炉 TG025QPS-NSH 2', '162', '511', '0|491|500|511|', '2299.00', '0', '1'), ('154', '225', '罗技（Logitech）G610 Cherry轴全尺寸背光 ', '173', '506', '0|491|502|506|', '499.00', '0', '1'), ('155', '226', 'OPPO R11 Plus 6GB+64GB 玫瑰金', '153', '497', '0|491|492|497|', '3699.00', '0', '1'), ('156', '227', '樱桃（Cherry）机械键盘G80-3000LSCEU-0白', '180', '506', '0|491|502|506|', '699.00', '0', '1'), ('157', '228', '未来人类(Terrans Force) T5-1060-67', '168', '494', '0|491|492|494|', '8499.00', '0', '1'), ('158', '229', 'Razer雷蛇 黑寡妇蜘蛛V2幻彩版 lol电竞游戏机械键盘', '179', '506', '0|491|502|506|', '1079.00', '0', '1'), ('159', '230', '小米（MI）小米便携鼠标 智能轻薄便携 无线+蓝牙双连接 家', '170', '505', '0|491|502|505|', '99.00', '0', '1'), ('160', '231', 'Razer雷蛇 Overwatch守望先锋游戏机械键盘 电脑', '179', '506', '0|491|502|506|', '1299.00', '0', '1'), ('161', '232', ' 小米6 全网通 6GB+128GB 探索银限量版', '170', '497', '0|491|492|497|', '4799.00', '0', '1'), ('162', '233', 'Cherry樱桃 MX-BOARD 9.0全无冲炫彩发光背光', '180', '506', '0|491|502|506|', '1369.00', '0', '1'), ('163', '234', '三星 Galaxy S8 Plus S8+（G9550）6G', '165', '497', '0|491|492|497|', '7288.00', '0', '1'), ('164', '235', 'CHERRY樱桃MX8.0背光87键机械键盘', '180', '506', '0|491|502|506|', '1719.00', '0', '1'), ('165', '236', ' 三星手机SM-W2017', '165', '497', '0|491|492|497|', '12999.00', '0', '1'), ('166', '237', '华硕（ASUS）RT-AC66U B1 AC双频1750M路', '181', '508', '0|491|502|508|', '649.00', '0', '1'), ('167', '238', '小米路由器3G 双千兆光纤宽带穿墙王 高增益四天线 散热好 ', '170', '508', '0|491|502|508|', '249.00', '0', '1'), ('168', '239', '华为（HUAWEI）联通/电信双4G版无线路由器 移动随身随', '159', '508', '0|491|502|508|', '349.00', '0', '1'), ('169', '240', '华为 Mate10 全网通版 6GB+128GB', '159', '497', '0|491|492|497|', '9999.00', '0', '1'), ('170', '241', ' 惠普(HP)暗影精灵III代Plus17.3英寸 ', '160', '494', '0|491|492|494|', '13468.00', '0', '1'), ('171', '242', 'Apple iPad MP2G2CH A 9.7英寸', '151', '499', '0|491|492|499|', '2588.00', '0', '1'), ('172', '243', ' 【送大礼包】华为(HUAWEI) 荣耀平板2 8英寸', '159', '499', '0|491|492|499|', '1199.00', '0', '1'), ('173', '244', '联想(Lenovo) MIIX320 10.1英寸', '161', '499', '0|491|492|499|', '2458.00', '0', '1'), ('174', '246', '海尔（Haier）BCD-216SDN 216升三门直冷冰箱 电脑智能控温 家用', '157', '495', '0|491|493|495|', '1599.00', '0', '1'), ('175', '247', '小米（MI）wifi 电力猫 穿墙宝 搭配路由器使用 白色', '170', '508', '0|491|502|508|', '249.00', '0', '1'), ('176', '249', '三星（SAMSUNG）BAR系列 32G 全金属五防 USB3.0 高速U盘 高速闪存盘 金属银', '165', '509', '0|491|502|509|', '82.00', '0', '1'), ('177', '250', ' 金立 大金钢2 全面屏 尊爵金 4G+64GB 全网通4G手机 双卡双待大电池智能手机', '182', '497', '0|491|492|497|', '1999.00', '0', '1'), ('178', '251', '三星（SAMSUNG）移动固态硬盘SSD T5 500GB （MU-PA500B/CN）', '165', '510', '0|491|502|510|', '1337.00', '0', '1'), ('179', '252', 'nubia努比亚Z17 畅享版 6GB+64GB 黑金 移动联通电信手机 无边框', '183', '497', '0|491|492|497|', '2000.00', '0', '1'), ('180', '253', '三星（SAMSUNG）移动固态硬盘SSD T5 2TB （MU-PA2T0B/CN）', '165', '510', '0|491|502|510|', '5999.00', '0', '1'), ('181', '254', '三星（SAMSUNG）移动固态硬盘SSD T5 1TB （MU-PA1T0B/CN）', '165', '510', '0|491|502|510|', '2999.00', '0', '1'), ('182', '255', 'nubia努比亚 Z17S (NX595J) 6GB+64GB 黑金 移动联通电信4G手机 无边框', '183', '497', '0|491|492|497|', '2999.00', '0', '1'), ('183', '256', '【保值之选】Apple iPhone 6 32G 金 移动联通电信4G 手机', '151', '497', '0|491|492|497|', '2449.00', '0', '1'), ('184', '257', 'Xiaomi小米 小米手机Max2 4GB+64GB 金色 移动联通电信4G大屏手机', '170', '497', '0|491|492|497|', '1699.00', '0', '1'), ('185', '258', 'Xbox One S 1TB双手柄竞技版 含体感器及三国志、最终幻想等11款游戏', '184', '519', '0|491|503|519|', '4788.00', '0', '1'), ('186', '259', 'honor荣耀V9 play标配版 3GB+32GB 幻夜黑', '187', '497', '0|491|492|497|', '999.00', '0', '1'), ('187', '260', '任天堂 Nintendo switch掌上游戏机便携式掌机Switch NS主机（红蓝手柄）+塞尔达', '185', '519', '0|491|503|519|', '3128.00', '0', '1'), ('188', '261', '索尼 Sony PlayStation 4 PS4 Pro 国行游戏主机 HDR色彩 支持4K 1TB容量 黑色', '186', '519', '0|491|503|519|', '3299.00', '0', '1'), ('189', '264', 'vivo X20 4GB+64GB 磨砂黑 移动联通电信4G手机 全面屏拍照 面部识别', '188', '497', '0|491|492|497|', '2998.00', '0', '1'), ('190', '265', '索尼（SONY）【PS4 官方配件】PS4 slim /PSV/PS4 Pro7.1声道 白金版无线头戴耳机', '167', '520', '0|491|503|520|', '1299.00', '1', '1'), ('191', '266', 'Huawei华为麦芒6 4GB+64GB 曜石黑 移动联通电信4G手机', '159', '497', '0|491|492|497|', '2399.00', '0', '1'), ('192', '267', 'Huawei华为 畅享7（SLA-AL00）3GB+32GB 香槟金 移动联通电信4G手机 高配版', '159', '497', '0|491|492|497|', '1099.00', '0', '1'), ('193', '268', '微软（Microsoft) Xbox 无线控制器 （蓝牙连接 带3.5mm的耳机接头 白色）', '184', '521', '0|491|503|521|', '429.00', '0', '1'), ('194', '269', '索尼（SONY）PlayStation4游戏手柄 新款PS4无线控制器（蓝色）', '186', '521', '0|491|503|521|', '380.00', '0', '1'), ('195', '270', 'vivo X9s 4GB+64GB 玫瑰金 移动联通电信4G拍照手机 双卡双待', '188', '497', '0|491|492|497|', '2498.00', '0', '1'), ('196', '271', '华硕(ASUS)灵耀S4000 14英寸笔记本电脑(i5-7200U 8G 256GSSD 620核心显卡 金属', '181', '494', '0|491|492|494|', '4899.00', '0', '1'), ('197', '272', '华硕(ASUS)飞行堡垒二代FX53 15.6英寸游戏笔记本电脑(i7-7700 8G 1T+128 4G红黑)', '181', '494', '0|491|492|494|', '7099.00', '0', '1'), ('198', '273', '索尼（SONY）PS4 Slim Pro 正版游戏软件 实体光盘 GTA5 猎车手5', '186', '522', '0|491|503|522|', '298.00', '0', '1'), ('199', '274', '雷神911 SE-E5a 15.6英寸游戏笔记本电脑I7-7700HQ 8G 128+1T GTX1050', '190', '494', '0|491|492|494|', '6199.00', '0', '1'), ('200', '275', '联想(Lenovo)拯救者Y520 15.6英寸游戏笔记本电脑(I7-7700 8G 1T+128G 4G独显 ', '161', '494', '0|491|492|494|', '8999.00', '0', '1'), ('201', '276', '华硕ASUS KZX53VE7700 15.6英寸笔记本电脑I7-7700 8G 1T 128G固态GTX1050ti', '181', '494', '0|491|492|494|', '7248.00', '0', '1'), ('202', '279', ' 戴尔DELL INS15-7567湛黑版15.6英寸笔记本电脑i7-7700 8G 1T+128G固态GTX1050t', '152', '494', '0|491|492|494|', '7288.00', '0', '1'), ('203', '280', ' 戴尔（DELL）游匣15-7577-R1765B 15.6英寸 i7-7700HQ 16G 256G+1T 6G独显', '152', '494', '0|491|492|494|', '10099.00', '0', '1'), ('204', '282', '雷神 911GT-Y6 17.3英寸大屏游戏本笔记本i7-7700HQ 16G 256G+1T GTX1060', '190', '494', '0|491|492|494|', '0.50', '0', '1'), ('205', '283', '未来人类(Terrans Force) X911-1080S-77X 桌面级i7-7700K 双GTX1080显卡 新', '168', '494', '0|491|492|494|', '39888.00', '0', '1'), ('206', '284', '九阳（Joyoung）电饭煲 JYF-30FE09 3升 多功能 7段智能温控 黄晶内胆 电饭锅', '162', '501', '0|491|500|501|', '0.00', '0', '1'), ('207', '285', '【三只松鼠_碧根果210gx2袋】零食坚果炒货山核桃长寿果干果奶油味 奶油口味', '3', '6', '0|1|2|6|', '38.90', '0', '1'), ('208', '286', '资生堂 珊珂 绵润泡沫洁面乳 120g', '61', '40', '0|38|39|40|', '52.00', '0', '1'), ('209', '287', '倩碧 CLINIQUE补水保湿润肤乳（黄油有油）黄油圣品125ml 美国直采', '53', '42', '0|38|39|42|', '159.00', '0', '1'), ('210', '288', 'LANCOME 兰蔻清滢保湿柔肤水粉水400ml 补水滋润正品大瓶装', '60', '385', '0|38|39|385|', '339.00', '0', '1'), ('211', '289', '美素佳儿（Friso）金装幼儿配方奶粉 3段（1-3岁幼儿适用）900克（荷兰原装进口）', '0', '58', '0|56|57|58|', '167.00', '0', '1'), ('212', '290', '爱他美（Aptamil）幼儿配方奶粉 3段(12-36个月适用) 800g （德国原装进口）', '0', '59', '0|56|57|59|', '185.00', '0', '1'), ('213', '291', '德运Devondale 全脂高钙成人奶粉 1KG', '66', '22', '0|4|5|22|', '49.00', '0', '1'), ('214', '292', '【内蒙古乌兰察布】草原星 内蒙特产牛肉干手撕500g实惠装 香辣味', '2', '306', '0|1|2|306|', '69.80', '0', '1'), ('215', '293', '费列罗FerreroRocher进口巧克力榛仁夹心巧克力婚庆喜糖礼盒节日礼物礼品T30粒装*2盒七夕情人节礼物', '11', '10', '0|1|3|10|', '126.00', '0', '1'), ('216', '294', 'Ferrero Rocher费列罗威化榛仁夹心巧克力T3*16粒装意大利进口婚庆喜糖巧克力礼盒装节日礼物礼品', '11', '10', '0|1|3|10|', '119.00', '0', '1'), ('217', '295', 'COCA-COLA可口可乐汽水樱桃口味355ml（美国进口 听）*12整箱装', '13', '14', '0|1|13|14|', '59.00', '0', '1'), ('218', '296', '安溪馆 三和清香型安溪铁观音茶叶一级 铁盒装250g', '35', '289', '0|1|288|289|', '35.00', '0', '1'), ('219', '297', '南国往事一枕清霜 茶叶 陈年普洱熟茶 七子饼茶 云南普尔茗茶 357g 包邮', '0', '290', '0|1|288|290|', '39.00', '0', '1'), ('220', '298', 'Apple iPhone 8 Plus 64GB 金色 移动联通电信4G手机', '151', '497', '0|491|492|497|', '6688.00', '0', '1'), ('221', '299', '三星 Galaxy S7 edge（G9350）4+64G版 铂光金 全网通', '165', '497', '0|491|492|497|', '3299.00', '0', '1'), ('222', '300', 'honor荣耀V9高配版 6GB+64GB 铂光金 移动联通电信4G手机', '187', '497', '0|491|492|497|', '2699.00', '0', '1'), ('223', '301', 'honor荣耀8 4GB+64GB 魅海蓝 移动联通电信4G手机', '187', '497', '0|491|492|497|', '1699.00', '0', '1'), ('224', '302', 'honor荣耀畅玩7X尊享版 4GB+128GB 铂光金 移动联通电信4G手机', '187', '497', '0|491|492|497|', '1999.00', '0', '1'), ('225', '303', '戴尔（DELL）灵越 13-7370-R1505S 13.3英寸轻薄笔记本电脑（i5-8250U 8G 128G', '152', '494', '0|491|492|494|', '6099.00', '0', '1'), ('226', '304', 'A', '2', '7', '0|1|2|7|', '100.00', '0', '1'), ('227', '305', 'B', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('228', '306', 'C', '151', '494', '0|491|492|494|', '20.00', '0', '1'), ('229', '307', 'A1', '2', '7', '0|1|2|7|', '100.00', '0', '1'), ('230', '308', 'B1', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('231', '309', 'C1', '2', '7', '0|1|2|7|', '20.00', '0', '1'), ('232', '310', 'D1', '2', '7', '0|1|2|7|', '10.00', '0', '1'), ('233', '311', 'E1', '2', '7', '0|1|2|7|', '10.00', '0', '1'), ('234', '312', '促销商品A', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('235', '313', '促销商品B', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('236', '314', '促销商品C', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('237', '315', '促销商品D', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('238', '316', '促销商品E', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('239', '317', '促销商品F', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('240', '318', '促销商品G', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('241', '319', '促销商品H', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('242', '320', '促销商品I', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('243', '321', '促销商品J', '2', '7', '0|1|2|7|', '50.00', '0', '1'), ('244', '322', '促销商品K', '2', '7', '0|1|2|7|', '100.00', '0', '1'), ('245', '323', '小米（MI）知吾煮汤锅 铝材锅身 耐腐蚀易清洁 食品级不黏涂层 导磁锅底 米家定制电磁炉煲汤锅 家用多功能火锅', null, '81', '0|79|80|81|', '99.00', '0', '1'), ('246', '324', '苏泊尔/SUPOR汤锅304不锈钢炖锅ST22Z1加厚家用锅具电磁炉燃气灶通用', null, '81', '0|79|80|81|', '149.00', '0', '1'), ('247', '325', '九阳（Joyoung）电水壶 K17-F66 容量1.7L 国产温控器 不锈钢电热水壶双层保温防烫 无缝内胆烧水壶', null, '82', '0|79|80|82|', '90.00', '0', '1'), ('248', '326', '美的（Midea）电水壶 WSJ1702b 1.7L 优质温控器 食品级304不锈钢 电热水瓶 电热水壶 电水壶', null, '82', '0|79|80|82|', '79.00', '0', '1'), ('249', '327', '爱仕达（ASD) 炒锅 NWG8330E 30CM易清洗 不粘锅 少油烟 不粘炒锅 电磁炉通用送原装木铲', null, '83', '0|79|80|83|', '99.00', '0', '1'), ('250', '328', '苏泊尔（SUPOR）炒锅NC32F4易洁不粘锅 32cm 少油烟 送原装木铲', null, '83', '0|79|80|83|', '169.00', '0', '1'), ('251', '329', '富光（FUGUANG) 玻璃杯WFB1020-500 500ml男女士带茶隔 便携创意双层泡茶玻璃水杯 500ml', null, '125', '0|79|124|125|', '10.00', '0', '1'), ('252', '330', '乐扣乐扣（lock&amp;lock）塑料杯 杯子水杯 随手杯 470ML HPL931', null, '126', '0|79|124|126|', '11.90', '0', '1'), ('253', '331', '东道 汝窑坐禅茶组 汝窑茶具套装开片汝瓷功夫整套茶具 坐禅小茶组一壶三杯-天青', null, '131', '0|79|130|131|', '20.00', '0', '1'), ('254', '332', '东道 汝窑 茶具配件 茶杯 品茗杯 小喜乐杯 开片可养金线 天青色 陶瓷 其他', null, '132', '0|79|130|132|', '186.00', '0', '1'), ('255', '333', '张小泉 (Zhang Xiao Quan) NS-7 合金指甲剪修甲剪刀脚趾剪子', null, '221', '0|79|219|221|', '12.00', '0', '1'), ('256', '334', 'LANCOME 兰蔻清滢保湿柔肤水大粉水400ml爽肤水女补水保湿补水滋润营养正品大瓶装 法国进口【最新版本】', '60', '383', '0|38|39|383|', '309.00', '0', '1');
COMMIT;

-- ----------------------------
--  Table structure for `es_sss_goods_pv`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_goods_pv`;
CREATE TABLE `es_sss_goods_pv` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT '主键id',
  `goods_id` int(10) DEFAULT NULL COMMENT '商品id',
  `goods_name` varchar(255) DEFAULT NULL COMMENT '商品名称',
  `vs_year` int(10) DEFAULT NULL COMMENT '年份',
  `vs_num` int(20) DEFAULT NULL COMMENT '访问量',
  `vs_month` int(10) DEFAULT NULL COMMENT '月份',
  `vs_day` int(10) DEFAULT NULL COMMENT '天',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8 COMMENT='商品访问量统计表(es_sss_goods_pv)';

-- ----------------------------
--  Records of `es_sss_goods_pv`
-- ----------------------------
BEGIN;
INSERT INTO `es_sss_goods_pv` VALUES ('1', '10', '百草味牛轧奶芙(蔓越莓味)160g 沙琪玛牛萨萨糕点心', '2018', '8', null, '1'), ('2', '1', '百草味菠萝干100g 菠萝块凤梨干/片蜜饯水果干小吃', '2018', '8', null, '4'), ('3', '2', '百草味手剥松子128g 坚果炒货干果特产开口手拨瓜子大籽', '2018', '8', null, '1'), ('4', '15', '洋河蓝色经典 海之蓝52度375ml 2瓶 洋河官方旗舰店 绵柔型白酒', '2018', '8', null, '1'), ('5', '1', '百草味菠萝干100g 菠萝块凤梨干/片蜜饯水果干小吃', '2018', '8', null, '3'), ('6', '16', '熊孩子 综合水果干108gx2袋混合装果干什锦脱水蔬果脆片休闲零食', '2018', '8', null, '1'), ('7', '2', '百草味手剥松子128g 坚果炒货干果特产开口手拨瓜子大籽', '2018', '8', null, '1'), ('8', '15', '洋河蓝色经典 海之蓝52度375ml 2瓶 洋河官方旗舰店 绵柔型白酒', '2018', '8', null, '2'), ('9', '16', '熊孩子 综合水果干108gx2袋混合装果干什锦脱水蔬果脆片休闲零食', '2018', '8', null, '1'), ('10', '15', '洋河蓝色经典 海之蓝52度375ml 2瓶 洋河官方旗舰店 绵柔型白酒', '2018', '8', null, '1'), ('11', '1', '百草味菠萝干100g 菠萝块凤梨干/片蜜饯水果干小吃', '2018', '8', null, '1');
COMMIT;

-- ----------------------------
--  Table structure for `es_sss_goods_pv_2018`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_goods_pv_2018`;
CREATE TABLE `es_sss_goods_pv_2018` (
  `id` int(10) NOT NULL DEFAULT '0',
  `goods_id` int(10) DEFAULT NULL,
  `goods_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `vs_year` int(10) DEFAULT NULL,
  `vs_month` int(10) DEFAULT NULL,
  `vs_day` int(10) DEFAULT NULL,
  `vs_num` int(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- ----------------------------
--  Records of `es_sss_goods_pv_2018`
-- ----------------------------
BEGIN;
INSERT INTO `es_sss_goods_pv_2018` VALUES ('1', '10', '百草味牛轧奶芙(蔓越莓味)160g 沙琪玛牛萨萨糕点心', '2018', '8', null, '1'), ('2', '1', '百草味菠萝干100g 菠萝块凤梨干/片蜜饯水果干小吃', '2018', '8', null, '4'), ('3', '2', '百草味手剥松子128g 坚果炒货干果特产开口手拨瓜子大籽', '2018', '8', null, '1'), ('4', '15', '洋河蓝色经典 海之蓝52度375ml 2瓶 洋河官方旗舰店 绵柔型白酒', '2018', '8', null, '1'), ('5', '1', '百草味菠萝干100g 菠萝块凤梨干/片蜜饯水果干小吃', '2018', '8', null, '3'), ('6', '16', '熊孩子 综合水果干108gx2袋混合装果干什锦脱水蔬果脆片休闲零食', '2018', '8', null, '1'), ('7', '2', '百草味手剥松子128g 坚果炒货干果特产开口手拨瓜子大籽', '2018', '8', null, '1'), ('8', '15', '洋河蓝色经典 海之蓝52度375ml 2瓶 洋河官方旗舰店 绵柔型白酒', '2018', '8', null, '2'), ('9', '16', '熊孩子 综合水果干108gx2袋混合装果干什锦脱水蔬果脆片休闲零食', '2018', '8', null, '1'), ('10', '15', '洋河蓝色经典 海之蓝52度375ml 2瓶 洋河官方旗舰店 绵柔型白酒', '2018', '8', null, '1'), ('11', '1', '百草味菠萝干100g 菠萝块凤梨干/片蜜饯水果干小吃', '2018', '8', null, '1');
COMMIT;

-- ----------------------------
--  Table structure for `es_sss_goods_pv_2019`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_goods_pv_2019`;
CREATE TABLE `es_sss_goods_pv_2019` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `goods_id` int(10) DEFAULT NULL,
  `goods_name` varchar(255) DEFAULT NULL,
  `vs_year` int(10) DEFAULT NULL,
  `vs_month` int(10) DEFAULT NULL,
  `vs_day` int(10) DEFAULT NULL,
  `vs_num` int(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1298 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `es_sss_member_register_data`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_member_register_data`;
CREATE TABLE `es_sss_member_register_data` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `member_id` int(10) DEFAULT NULL COMMENT '会员id',
  `member_name` varchar(255) DEFAULT NULL COMMENT '会员名字',
  `create_time` int(12) DEFAULT NULL COMMENT '注册日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=111 DEFAULT CHARSET=utf8 COMMENT='注册会员信息(es_sss_member_register_data)';

-- ----------------------------
--  Records of `es_sss_member_register_data`
-- ----------------------------
BEGIN;
INSERT INTO `es_sss_member_register_data` VALUES ('76', '2', 'javashop', '1421329021'), ('77', '6', 'demo_woman', '1427854864'), ('78', '11', 'toys', '1427962143'), ('79', '16', 'food', '1428651298'), ('80', '25', 'superman', '1464430868'), ('81', '26', 'kans', '1464509078'), ('82', '27', 'appliance', '1508506621'), ('83', '28', 'kanon', '1509000654'), ('84', '29', 'wanghui', '1509000745'), ('85', '30', 'xulipeng', '1509000772'), ('86', '31', 'spring', '1509009430'), ('87', '32', 'martin', '1509009465'), ('88', '33', 'java', '1509009516'), ('89', '34', '六月的雨', '1509009562'), ('90', '35', '陈冠希_', '1509009674'), ('91', '36', '秋刀鱼的滋味', '1509009737'), ('92', '37', '春风十里_不如你', '1509009786'), ('93', '38', '下个路口见', '1509009923'), ('94', '39', 'batman', '1509073225'), ('95', '40', 'spiderman', '1509073858'), ('96', '41', 'antman', '1509074080'), ('97', '42', 'ironman', '1509074212'), ('98', '43', 'hock', '1509074489'), ('99', '44', 'eagle', '1509075137'), ('100', '45', 'green', '1509075866'), ('101', '46', 'blue', '1509084831'), ('102', '47', 'black', '1509084961'), ('103', '48', 'lion', '1509085091'), ('104', '49', '麦芽糖_', '1509431392'), ('105', '50', '回到过去', '1509433744'), ('106', '51', 'm_18555555555', '1534837036'), ('107', '52', 'fengkun', '1534917930'), ('108', '53', 'chopper', '1535340715'), ('109', '54', 'AAA', '1535442162'), ('110', '55', 'javashop7', '1535443163');
COMMIT;

-- ----------------------------
--  Table structure for `es_sss_order_data`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_order_data`;
CREATE TABLE `es_sss_order_data` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `sn` varchar(255) DEFAULT NULL COMMENT '订单编号',
  `buyer_id` int(10) DEFAULT NULL COMMENT '会员id',
  `buyer_name` varchar(255) DEFAULT NULL COMMENT '商家名称',
  `order_status` varchar(255) DEFAULT NULL COMMENT '订单状态',
  `pay_status` varchar(255) DEFAULT NULL COMMENT '付款状态',
  `order_price` decimal(20,2) DEFAULT NULL COMMENT '订单金额',
  `goods_num` int(10) DEFAULT NULL COMMENT '订单商品数量',
  `ship_province_id` int(10) DEFAULT NULL COMMENT '省id',
  `ship_city_id` int(10) DEFAULT NULL COMMENT '市id',
  `create_time` int(12) DEFAULT NULL COMMENT '订单创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=73 DEFAULT CHARSET=utf8 COMMENT='订单数据(es_sss_order_data)';

-- ----------------------------
--  Table structure for `es_sss_order_data_2018`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_order_data_2018`;
CREATE TABLE `es_sss_order_data_2018` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `sn` varchar(255) DEFAULT NULL COMMENT '订单编号',
  `buyer_id` int(10) DEFAULT NULL COMMENT '会员id',
  `buyer_name` varchar(255) DEFAULT NULL COMMENT '商家名称',
  `order_status` varchar(255) DEFAULT NULL COMMENT '订单状态',
  `pay_status` varchar(255) DEFAULT NULL COMMENT '付款状态',
  `order_price` decimal(20,2) DEFAULT NULL COMMENT '订单金额',
  `goods_num` int(10) DEFAULT NULL COMMENT '订单商品数量',
  `ship_province_id` int(10) DEFAULT NULL COMMENT '省id',
  `ship_city_id` int(10) DEFAULT NULL COMMENT '市id',
  `create_time` int(12) DEFAULT NULL COMMENT '订单创建时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=70 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `es_sss_order_data_2019`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_order_data_2019`;
CREATE TABLE `es_sss_order_data_2019` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `sn` varchar(255) DEFAULT NULL,
  `buyer_id` int(10) DEFAULT NULL,
  `buyer_name` varchar(255) DEFAULT NULL,
  `order_status` varchar(255) DEFAULT NULL,
  `pay_status` varchar(255) DEFAULT NULL,
  `order_price` decimal(20,2) DEFAULT NULL,
  `goods_num` int(10) DEFAULT NULL,
  `ship_province_id` int(10) DEFAULT NULL,
  `ship_city_id` int(10) DEFAULT NULL,
  `create_time` int(20) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=175 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `es_sss_order_goods_data`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_order_goods_data`;
CREATE TABLE `es_sss_order_goods_data` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `order_sn` varchar(255) DEFAULT NULL COMMENT '订单编号',
  `goods_id` int(10) DEFAULT NULL COMMENT '商品id',
  `goods_name` varchar(255) DEFAULT NULL COMMENT '商品名称',
  `goods_num` int(10) DEFAULT NULL COMMENT '数量',
  `price` decimal(20,2) DEFAULT NULL COMMENT '商品单价',
  `sub_total` decimal(20,2) DEFAULT NULL COMMENT '小计',
  `category_path` varchar(255) DEFAULT NULL COMMENT '分类path',
  `category_id` int(10) DEFAULT NULL COMMENT '分类id',
  `create_time` int(12) DEFAULT NULL COMMENT '创建时间',
  `industry_id` bigint(10) DEFAULT NULL COMMENT '行业id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=100 DEFAULT CHARSET=utf8 COMMENT='订单商品表(es_sss_order_goods_data)';

-- ----------------------------
--  Table structure for `es_sss_order_goods_data_2018`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_order_goods_data_2018`;
CREATE TABLE `es_sss_order_goods_data_2018` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `order_sn` varchar(255) DEFAULT NULL COMMENT '订单编号',
  `goods_id` int(10) DEFAULT NULL COMMENT '商品id',
  `goods_name` varchar(255) DEFAULT NULL COMMENT '商品名称',
  `goods_num` int(10) DEFAULT NULL COMMENT '数量',
  `price` decimal(20,2) DEFAULT NULL COMMENT '商品单价',
  `sub_total` decimal(20,2) DEFAULT NULL COMMENT '小计',
  `category_path` varchar(255) DEFAULT NULL COMMENT '分类path',
  `category_id` int(10) DEFAULT NULL COMMENT '分类id',
  `create_time` int(12) DEFAULT NULL COMMENT '创建时间',
  `industry_id` bigint(10) DEFAULT NULL COMMENT '行业id',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=97 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `es_sss_order_goods_data_2019`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_order_goods_data_2019`;
CREATE TABLE `es_sss_order_goods_data_2019` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `order_sn` varchar(255) DEFAULT NULL,
  `goods_id` int(10) DEFAULT NULL,
  `goods_name` varchar(255) DEFAULT NULL,
  `goods_num` int(10) DEFAULT NULL,
  `price` decimal(20,2) DEFAULT NULL,
  `sub_total` decimal(20,2) DEFAULT NULL,
  `category_path` varchar(255) DEFAULT NULL,
  `category_id` int(10) DEFAULT '0',
  `create_time` int(12) DEFAULT '0',
  `industry_id` int(10) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=206 DEFAULT CHARSET=utf8;

-- ----------------------------
--  Table structure for `es_sss_refund_data`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_refund_data`;
CREATE TABLE `es_sss_refund_data` (
  `id` int(10) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `order_sn` varchar(255) DEFAULT NULL COMMENT '订单sn',
  `refund_sn` varchar(255) DEFAULT NULL COMMENT '售后订单sn',
  `refund_price` decimal(20,2) DEFAULT NULL COMMENT '退还金额',
  `create_time` int(12) DEFAULT NULL COMMENT '创建日期',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8 COMMENT='退货数据(es_sss_refund_data)';

-- ----------------------------
--  Table structure for `es_sss_refund_data_2018`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_refund_data_2018`;
CREATE TABLE `es_sss_refund_data_2018` (
  `id` int(10) NOT NULL DEFAULT '0',
  `refund_sn` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `order_sn` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL,
  `refund_price` decimal(20,2) DEFAULT NULL,
  `create_time` int(12) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

-- ----------------------------
--  Table structure for `es_sss_refund_data_2019`
-- ----------------------------
DROP TABLE IF EXISTS `es_sss_refund_data_2019`;
CREATE TABLE `es_sss_refund_data_2019` (
  `id` int(10) NOT NULL AUTO_INCREMENT,
  `refund_sn` varchar(255) DEFAULT NULL,
  `order_sn` varchar(255) DEFAULT NULL,
  `refund_price` decimal(20,2) DEFAULT NULL,
  `create_time` int(12) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8;

SET FOREIGN_KEY_CHECKS = 1;
